{
  "no": 6,
  "pubDate": "2025-05-25T23:59:59.999Z",
  "articles": [
    {
      "title": "Design System In 90 Days",
      "url": "https://smashingmagazine.com/2025/05/design-system-in-90-days/",
      "author": "Vitaly Friedman",
      "pubDate": "2025-05-19T10:00:00.000Z",
      "description": "Explore helpful PDF worksheets and tools designed to kickstart and promote adoption of your design system, all inspired by the \"How To Measure UX and Design Impact\" course that highlights the value of your UX work.",
      "categories": [],
      "img": "http://files.smashing.media/articles/design-system-in-90-days/design-system-in-90-days.jpg"
    },
    {
      "title": "A Reader’s Question on Nested Lists",
      "url": "https://css-tricks.com/a-readers-question-on-nested-lists/",
      "author": "CSS-Tricks",
      "pubDate": "2025-05-19T12:32:22.000Z",
      "description": "Delve into techniques for creating complex, nested numbering systems with CSS list counters, answering a common question about customizing list styles for intricate list structures.",
      "categories": [
        "Articles",
        "lists"
      ]
    },
    {
      "title": "Creating Blob Shapes using clip-path: shape()",
      "url": "https://frontendmasters.com/blog/creating-blob-shapes-using-clip-path-shape/",
      "author": "Frontend Masters",
      "pubDate": "2025-05-19T14:30:05.000Z",
      "description": "Discover blobs—playful, gooey shapes that can be filled with backgrounds and animated for engaging visual effects in your web designs.",
      "categories": [
        "Blog Post",
        "Blob",
        "CSS",
        "Shapes"
      ]
    }
  ],
  "description": "Discover innovative tools to enhance your design system's adoption while understanding the importance of measuring UX impact. Master the art of complex list styling using CSS counters for intricate layouts, and explore the creative possibilities of animated blobs for visually captivating web designs.",
  "joke": "Why do JavaScript developers prefer coffee? Because they don't like dealing with promises.",
  "challenge": "Create an interactive blob animation using HTML, CSS, and JavaScript. Experiment with different shapes, colors, and background patterns to make dynamic, engaging visuals that respond to user interactions. Utilize CSS animations and transformations for smooth transitions and consider adding audio effects using the Web Audio API for an immersive experience."
}