{
  "no": 7,
  "pubDate": "2025-05-25T23:59:59.999Z",
  "articles": [
    {
      "title": "Design System In 90 Days",
      "url": "https://smashingmagazine.com/2025/05/design-system-in-90-days/",
      "author": "Vitaly Friedman",
      "pubDate": "2025-05-19T10:00:00.000Z",
      "description": "Discover helpful PDF worksheets and tools to kickstart and promote adoption of your design system, supported by insights from How To Measure UX and Design Impact—a friendly guide to demonstrating your UX work’s business value.",
      "categories": [],
      "img": "http://files.smashing.media/articles/design-system-in-90-days/design-system-in-90-days.jpg"
    },
    {
      "title": "A Reader’s Question on Nested Lists",
      "url": "https://css-tricks.com/a-readers-question-on-nested-lists/",
      "author": "CSS-Tricks",
      "pubDate": "2025-05-19T12:32:22.000Z",
      "description": "Exploring how to craft complex, nested numbering systems using CSS list counters—answering a reader’s question on creating advanced list styles with CSS tricks.",
      "categories": [
        "Articles",
        "lists"
      ]
    },
    {
      "title": "Creating Blob Shapes using clip-path: shape()",
      "url": "https://frontendmasters.com/blog/creating-blob-shapes-using-clip-path-shape/",
      "author": "Frontend Masters",
      "pubDate": "2025-05-19T14:30:05.000Z",
      "description": "Dive into blobs! These gooey, organic shapes can be filled with backgrounds, animated, and used to add playful, dynamic visuals to your web designs.",
      "categories": [
        "Blog Post",
        "Blob",
        "CSS",
        "Shapes"
      ]
    }
  ],
  "description": "Unlock the potential of design systems with insightful resources and metrics for measuring UX impact, explore the depths of CSS list counters to create sophisticated nested numbering, and add a playful touch to your designs with animated blob shapes.",
  "joke": "Why did the JavaScript developer leave the restaurant? Because they couldn't 'table' their ideas.",
  "challenge": "Create an animated blob generator using HTML, CSS, and JavaScript. Allow users to customize the blob's shape, color, and animation speed, and then export their creation as an SVG or a downloadable image. Experiment with different CSS properties and JavaScript controls to bring these gooey, dynamic visuals to life."
}