{
  "no": 6,
  "pubDate": "2025-05-25T23:59:59.999Z",
  "articles": [
    {
      "title": "Design System In 90 Days",
      "url": "https://smashingmagazine.com/2025/05/design-system-in-90-days/",
      "author": "Vitaly Friedman",
      "pubDate": "2025-05-19T10:00:00.000Z",
      "description": "Discover helpful PDFs and tools to kickstart and promote adoption of your design system, complemented by insights from How To Measure UX and Design Impact—your guide to demonstrating the value of UX work.",
      "categories": [],
      "img": "http://files.smashing.media/articles/design-system-in-90-days/design-system-in-90-days.jpg"
    },
    {
      "title": "A Reader’s Question on Nested Lists",
      "url": "https://css-tricks.com/a-readers-question-on-nested-lists/",
      "author": "CSS-Tricks",
      "pubDate": "2025-05-19T12:32:22.000Z",
      "description": "Exploring how to craft complex numbering systems with CSS list counters—answering a reader's question about nested lists and advanced list styling techniques.",
      "categories": [
        "Articles",
        "lists"
      ]
    },
    {
      "title": "How To Generate And Open HAR Files",
      "url": "https://www.debugbear.com/blog/generate-open-har-files",
      "author": "DebugBear",
      "pubDate": "2025-05-19T00:00:00.000Z",
      "description": "HAR files capture resource load details on websites, serving as a powerful debugging tool for identifying and fixing visitor-facing issues.",
      "categories": []
    },
    {
      "title": "Creating Blob Shapes using clip-path: shape()",
      "url": "https://frontendmasters.com/blog/creating-blob-shapes-using-clip-path-shape/",
      "author": "Frontend Masters",
      "pubDate": "2025-05-19T14:30:05.000Z",
      "description": "Dive into blobs—playful, gooey shapes that can be filled with backgrounds and animated for creative, dynamic UI effects.",
      "categories": [
        "Blog Post",
        "Blob",
        "CSS",
        "Shapes"
      ]
    }
  ],
  "description": "Embrace the fusion of design systems and UX impact measurement with insightful resources and tools. Unveil the art of crafting intricate numbering systems using CSS list counters for advanced styling. Enhance your debugging skills with HAR files, a key to resolving user-experience issues. Lastly, explore the playful world of animated blobs to add dynamic flair to your UI designs.",
  "joke": "Why did the CSS developer bring a ladder to work? Because they heard the website had a few 'float' problems!",
  "challenge": "Create an interactive blob animation using HTML, CSS, and JavaScript. Design gooey shapes that morph and change, incorporating background colors or gradients. Enhance the animation by making the blobs react to user interactions, like mouse movements or clicks. This challenge will test your skills in CSS animations and JavaScript event handling, resulting in a visually engaging and dynamic UI element."
}