{
  "no": 6,
  "pubDate": "2025-05-25T23:59:59.999Z",
  "articles": [
    {
      "title": "Design System In 90 Days",
      "url": "https://smashingmagazine.com/2025/05/design-system-in-90-days/",
      "author": "Vitaly Friedman",
      "pubDate": "2025-05-19T10:00:00.000Z",
      "description": "Discover practical PDF worksheets and tools to kickstart and promote your design system efforts, supported by insights from How To Measure UX and Design Impact—helping you showcase the value of your UX work effectively.",
      "categories": [],
      "img": "http://files.smashing.media/articles/design-system-in-90-days/design-system-in-90-days.jpg"
    },
    {
      "title": "A Reader’s Question on Nested Lists",
      "url": "https://css-tricks.com/a-readers-question-on-nested-lists/",
      "author": "CSS-Tricks",
      "pubDate": "2025-05-19T12:32:22.000Z",
      "description": "Exploring techniques for creating complex, nested numbering systems with CSS list counters—answering a common question from CSS-Tricks about customizing list styles for intricate hierarchies.",
      "categories": [
        "Articles",
        "lists"
      ]
    },
    {
      "title": "Creating Blob Shapes using clip-path: shape()",
      "url": "https://frontendmasters.com/blog/creating-blob-shapes-using-clip-path-shape/",
      "author": "Frontend Masters",
      "pubDate": "2025-05-19T14:30:05.000Z",
      "description": "Dive into blobs—playful, gooey shapes that can be filled with backgrounds and animated for engaging, dynamic visuals on your website.",
      "categories": [
        "Blog Post",
        "Blob",
        "CSS",
        "Shapes"
      ]
    }
  ],
  "description": "Explore the importance of design systems with practical worksheets, understand measuring UX impact, master complex CSS list counters, and dive into the playful world of blobs for dynamic website visuals.",
  "joke": "Why do JavaScript developers prefer dark mode? Because light attracts bugs!",
  "challenge": "Create a visually engaging landing page featuring animated blobs. Use HTML, CSS, and JavaScript to design playful, gooey shapes that move and morph as users interact with the page. Incorporate customizable backgrounds and explore CSS animations to bring these blobs to life, enhancing user experience with fun, dynamic visuals."
}