{
  "no": 1,
  "pubDate": "2025-05-18T23:59:59.999Z",
  "title": "Weekly Digest – 12/05/2025, 00:00:00 → 18/05/2025, 23:59:59",
  "articles": [
    {
      "title": "Integrating Rive into a React Project: Behind the Scenes of Valley Adventures",
      "url": "https://tympanus.net/codrops/2025/05/12/integrating-rive-into-a-react-project-behind-the-scenes-of-valley-adventures/",
      "author": "Codrops",
      "pubDate": "2025-05-12T12:30:00.000Z",
      "description": "A hands-on guide to integrating Rive into a React project, blending smooth interactivity with whimsical animation for Chumbi Valley’s Adventures.",
      "categories": [
        "Tutorials",
        "react",
        "rive"
      ]
    },
    {
      "title": "Motion Highlights #6",
      "url": "https://tympanus.net/codrops/2025/05/12/motion-highlights-6/",
      "author": "Codrops",
      "pubDate": "2025-05-12T10:04:55.000Z",
      "description": "A freshy curated collection of recent motion design work by creative makers.",
      "categories": [
        "UI Interactions and Animations Roundups",
        "inspiration",
        "motion-design",
        "roundup"
      ]
    },
    {
      "title": "Integrating Localization Into Design Systems",
      "url": "https://smashingmagazine.com/2025/05/integrating-localization-into-design-systems/",
      "author": "Rebecca Hemstad & Mark Malek",
      "pubDate": "2025-05-12T10:00:00.000Z",
      "description": "Learn how two designers tackled the challenges of building a localization-ready design system for a global audience. This case study dives into how Rebecca and Mark combined Figma Variables and design tokens to address multilingual design issues, such as text overflow, RTL layouts, and font inconsistencies.",
      "categories": [],
      "img": "http://files.smashing.media/articles/integrating-localization-into-design-systems/integrating-localization-into-design-systems.jpg"
    },
    {
      "title": "Tag, I'm It",
      "url": "https://nerdy.dev/blogging-about-blogging?utm_source=rss",
      "author": "Adam Argyle",
      "pubDate": "2025-05-12T15:21:30.000Z",
      "description": "<p><a href=\"https://kilianvalkhof.com/2025/life/tag-youre-it/\">Killian</a> tagged me in this blog chain letter type thing to answer some questions about blogging. I accept 🙂</p>\n\n        <h2>\n          Why did you start blogging in the first place?\n          <a name=\"why-did-you-start-blogging-in-the-first-place?\" href=\"#why-did-you-start-blogging-in-the-first-place?\">#</a>\n        </h2>\n       <p>My first exploration into blogging was Wordpress, I called it Geek Devigner. I wanted to share about the cross of development and design (devigner). I didn&#39;t write on it much, I was still making mostly Flash and jQuery stuff. Needless to say, this wasn&#39;t a super popular topic to be blogging about.</p>\n<p>Later I wrote posts on Medium or Devto. This was mostly during the JAMstack wave, and I was really intent on optimizing the build systems so Jade was only rendering the render trees that changed all while making my own isomorphic framework. I also like Grunt more than Gulp, so again, this wasn&#39;t a super popular topic to be blogging about.</p>\n<p>After blogging and writing articles at Google, I wanted to write in my own voice and showcase CSS features while talking about CSS features. I figured most people these days are scrolling cards and like content feeds, so I modelled my site after these interactions and started blogging about CSS, Javascript and HTML stuff consistently for the first time.</p>\n\n        <h2>\n          What platform are you using to manage your blog and why did you choose it?\n          <a name=\"what-platform-are-you-using-to-manage-your-blog-and-why-did-you-choose-it?\" href=\"#what-platform-are-you-using-to-manage-your-blog-and-why-did-you-choose-it?\">#</a>\n        </h2>\n       <p>My current site/blog is built on <a href=\"https://deno.com/\">Deno</a> and their <a href=\"https://fresh.deno.dev/\">Fresh</a> framework. I blogged about it <a href=\"https://nerdy.dev/new-year-new-site\">here</a>.</p>\n<p><picture>\n            <source srcset=\"/media/fresh-features.avif\" type=\"image/avif\">\n            <source srcset=\"/media/fresh-features.webp\" type=\"image/webp\">\n            <img \n              loading=\"lazy\" \n              src=\"/media/fresh-features.jpg\" \n              alt=\"\" \n              title=\"A screenshot from the features list on the Fresh website \" \n              decoding=\"async\"\n              width=\"1538\" \n              height=\"854\"\n            />\n          </picture></p>\n<p>For me it was a decently minimal set of features that Fresh brought while Deno brought a small, safe, web standards focused server.</p>\n<p>I wanted to do lots of custom things, so I needed something that wasn&#39;t going to be in the way. I wanted to make something server first, a bit more socially integrated than previous static sites I&#39;d built, and to try out islands front-end architecture.</p>\n\n        <h2>\n          How do you write your posts?\n          <a name=\"how-do-you-write-your-posts?\" href=\"#how-do-you-write-your-posts?\">#</a>\n        </h2>\n       <p>I write posts in a markdown file with some custom frontmatter. Notes have slightly different frontmatter than blog posts, otherwise they&#39;re the same.</p>\n<p>I&#39;ve written all my own adapters for images, code snippets and videos. The images are swapped for a <code>&lt;picture&gt;</code> with optimised sources. The code snippets are rendered server side. Videos are also optimized, given poster images, and other cool stuff.</p>\n<p>All of this is done in a code editor. Currently <a href=\"https://zed.dev\">Zed</a>, but often <a href=\"https://windsurf.com/editor\">Windsurf</a>, <a href=\"https://www.sublimetext.com\">Sublime</a> or <a href=\"https://code.visualstudio.com\">VS Code</a> (I flop around alot, but usually go back to Sublime for the nicer text rendering and bootup speeds).</p>\n<p>If I need any special examples or interactives, I either write an inline style or script tag, or make a web component.</p>\n\n        <h2>\n          When do you feel most inspired to write?\n          <a name=\"when-do-you-feel-most-inspired-to-write?\" href=\"#when-do-you-feel-most-inspired-to-write?\">#</a>\n        </h2>\n       <p>When reading my RSS feed. But, that&#39;s not when I write… that&#39;s once the kids are asleep.</p>\n\n        <h2>\n          Do you publish immediately?\n          <a name=\"do-you-publish-immediately?\" href=\"#do-you-publish-immediately?\">#</a>\n        </h2>\n       <p>Longer form posts definitely simmer or chill in a branch for a while. Shorter form posts though, those can be authored and published in just a few minutes. I needed to have both opportunities, was important to me that both types of thoughts could be posted to my site.</p>\n\n        <h2>\n          What are you generally interested in writing about?\n          <a name=\"what-are-you-generally-interested-in-writing-about?\" href=\"#what-are-you-generally-interested-in-writing-about?\">#</a>\n        </h2>\n       <p>CSS, almost exclusively. However, every once in a while I&#39;ll share a JS tip (which is usually CSS adjacent).</p>\n\n        <h2>\n          What’s your favourite post on your blog?\n          <a name=\"what’s-your-favourite-post-on-your-blog?\" href=\"#what’s-your-favourite-post-on-your-blog?\">#</a>\n        </h2>\n       <p>There&#39;s a few that come to mind, but the winner is <a href=\"https://nerdy.dev/headless-boneless-and-skinless-ui\">Headless, boneless and skinless UI</a>. I liked how the piece came together around Halloween when the content was totally morbib sounding out of context.</p>\n\n        <h2>\n          Who are you writing for?\n          <a name=\"who-are-you-writing-for?\" href=\"#who-are-you-writing-for?\">#</a>\n        </h2>\n       <p>UI and UX engineers, a few designers and other folks who want to stay up to date on CSS. Mostly writing for professionals or experts, but do try to make things minimal to reduce learning friction for everyone.</p>\n\n        <h2>\n          Any future plans for your blog?\n          <a name=\"any-future-plans-for-your-blog?\" href=\"#any-future-plans-for-your-blog?\">#</a>\n        </h2>\n       <p>I&#39;ve got quite a long list of features in the backlog.</p>\n<p>I&#39;d like to add a bunch more &quot;slashers&quot;, which are just cool slash pages like <a href=\"https://nerdy.dev/follows\">/follows</a> and <a href=\"https://nerdy.dev/404\">/404</a>. So far I&#39;ve got <code>/talks</code>, <code>/experiments</code>, <code>/avatar</code>, <code>/toolkit</code>, and <code>/links</code> in the backlog.</p>\n<p>I&#39;ve got the personas already, but I want to give them their own profile pages with all their specific posts. They&#39;d also get their own RSS feeds 😉</p>\n<p>The most notable backlog item, is to have <a href=\"https://www.playbalatro.com\">Balatro</a> style powerups and &quot;shiny&quot; type effects for the cards on the home feed. Just a little piece of frontmatter that adds a class to the card, then CSS does the rest: makes a post foiled, or cracked, or holographic. Be so fun to make.</p>\n\n        <h2>\n          Who am I going to tag?\n          <a name=\"who-am-i-going-to-tag?\" href=\"#who-am-i-going-to-tag?\">#</a>\n        </h2>\n       <p>Maybe you? Anyone out there want to be tagged?</p>\n<p>I&#39;ll tag you right here.</p>\n",
      "categories": [
        "blog"
      ]
    },
    {
      "title": "Using Pages CMS for Static Site Content Management",
      "url": "https://css-tricks.com/using-pages-cms-for-static-site-content-management/",
      "author": "CSS-Tricks",
      "pubDate": "2025-05-12T12:42:10.000Z",
      "description": "<p>I know, I know: there are a ton of content management system options available, and while I've tested several, none have really been the one, y'know? Weird pricing models, difficult customization, some even end up becoming a whole 'nother thing to manage.</p>\n<hr />\n<p><small><a rel=\"nofollow\" href=\"https://css-tricks.com/using-pages-cms-for-static-site-content-management/\">Using Pages CMS for Static Site Content Management</a> originally published on <a rel=\"nofollow\" href=\"https://css-tricks.com\">CSS-Tricks</a>, which is part of the <a href=\"https://try.digitalocean.com/css-tricks/?utm_medium=rss&amp;utm_source=css-tricks.com&amp;utm_campaign=family_&amp;utm_content=\">DigitalOcean</a> family. You should <a href=\"https://css-tricks.com/newsletters/\">get the newsletter</a>.</p>\n",
      "categories": [
        "Articles",
        "CMS",
        "static sites"
      ]
    },
    {
      "title": "Enhancements to the <permission> element",
      "url": "https://developer.chrome.com/blog/enhancements-to-permission-element?hl=en",
      "author": "developer.chrome.com",
      "pubDate": "2025-05-12T07:00:00.000Z",
      "description": "The permission HTML element is no longer void and also has support for icons.",
      "categories": []
    },
    {
      "title": "We need your support to do free projects for good causes and publish free high quality education",
      "url": "https://piccalil.li/blog/we-need-your-support-to-do-free-projects-for-good-causes-and-publish-free-high-quality-education/?ref=articles-rss-feed",
      "author": "Piccalilli",
      "pubDate": "2025-05-13T11:55:00.000Z",
      "description": "<p>We're trying a rather radical new approach at Piccalilli. We're going to do real world projects — for real clients — in the open, sharing as much of the process as we possibly can. This gives us a context to provide genuine high quality, real world education <strong>for free at the point of entry</strong>. This is a complete business model shift — one that is focused on <strong>giving back more than we take</strong>.</p>\n<hr />\n<p>You may or may not know that Piccalilli is a part of <a href=\"https://set.studio/\">Set Studio</a>. The studio works primarily with <em>for-profit</em> clients and has a fantastic track record of making those clients more money by delivering high quality design and development.</p>\n<p>By focusing on the user, progressive enhancement and web standards, we produce websites that work for everyone. That, along with our deep understanding of content strategy, conversion optimisation, user experience and information architecture is what brings companies success as a result of hiring us.</p>\n<p>The problem is, <strong>we’re fed up of doing that</strong> — well, we're fed up of utilising our skills for the sake of more profit. By proxy, we're also fed up of working within an industry model that’s purpose is to <a href=\"https://bell.bz/im-getting-fed-up-of-making-the-rich-richer/\">make the rich, richer</a>.</p>\n\n<p>We’re fed up of working in an industry model that’s purpose is to make the Rich richer.</p>\n\n<p>We instead, want to use our extensive skills to <strong>do work for good</strong>, primarily helping campaigns and movements that will make people's lives <em>tangibly better</em>. We also want to help our tech community by providing extremely high quality education that is <strong>free at the point of entry for everyone</strong>.</p>\n<h2>What does this look like?</h2>\n<p>It all starts with us delivering some internal projects — working in the open and sharing as much as is feasible with the community so that people can learn how this stuff works in the real world.</p>\n<p>The reason we are starting with internal projects, is because we need to find our feet when it comes to working in the open. By doing a couple of internal projects first, we can <em>iron out the kinks</em> and receive feedback from the community on the education material that comes from that.</p>\n<p>With a solid methodology, evolved from these early projects, we're then going to expand this effort into producing outstanding web experiences for progressive movements and campaigns that are trying to make people's lives better. These might include  small charities or movements that are putting pressure on elected officials. We think that we can <em>super-charge</em> these types of organisations where they need it the most — design, messaging and web presence.</p>\n<p>There's a real need for progressive movements to receive as much power as possible as the world seemingly sleep walks into AI slop, fascism and hard-right policies. The right wing and authoritarian leaning political movements get everything handed to them on a plate including funding, lobbying and relentless mainstream media coverage. Not to mention,  benefiting from favourable algorithms on mainstream social media networks like Facebook, Instagram, TikTok and Twitter (now known as \"X\").</p>\n<p>In terms of a timeline, we're aiming to begin working in the open with the following projects:</p>\n<ol>\n<li>An iteration of a Piccalilli-focused feature running from early June until July</li>\n<li>A full redesign of the <a href=\"https://cube.fyi/\">CUBE CSS website</a> from scratch, running from July until September/October</li>\n<li>The first project for a progressive movement, running from October until the end of the year</li>\n<li>An ongoing focus on progressive projects in 2026</li>\n</ol>\n<h2>This plan can only happen with community funding</h2>\n<p><strong>We need your help to make this a reality</strong>. In order for this plan to work, we need to replace the revenue that comes from commercial client work. <a href=\"https://opencollective.com/piccalilli\">We've set up an Open Collective</a> that allows individuals and companies to financially back us, from as little as £3 a month and up to as much as you can afford. You can even make a one-off donation where you can pay whatever you like.</p>\n<p>We've set up an <a href=\"https://opencollective.com/piccalilli\">Open Collective</a> because it's <em>transparent</em>. We need to build everyone’s trust for this to work, so funding that runs through a transparent platform like Open Collective, is going to only help that.</p>\n\n<p>We’ve set up an Open Collective because it’s transparent.</p>\n\n<p>With your support, we can <strong>actually make a difference</strong> to both the design and development community, as well as progressive movements that will aim to make the lives tangibly better of those people that <em>really</em> need help.</p>\n<p>A community supported movement that opens up education resources typically only available to those that can afford it, is so important and <em>needed</em>. The dual benefit of free at the point of entry, real world education, and progressive movements getting the full backing of a leading agency, will be a game changer. <strong>It is however, only a game changer,  if it works</strong>. With your support, it <strong>will</strong> work.</p>\n<p>Support Piccalilli on Open Collective</p>\n<h2>What are we trying to achieve in terms of education?</h2>\n<p>I've been doing this job for a very long time — coming up to 17 years now. A rather sizeable portion of that time has been spent educating people.</p>\n<p>Over the last half a decade or so, my focus could be summarised as this:</p>\n<blockquote>\n<p>Instead of trying to control every single element of a website, you can actually produce something that works for everyone, if you just let the browser do its job</p>\n</blockquote>\n<p>That summary is bolted on to years of me <em>constantly</em> talking about <a href=\"https://piccalil.li/blog/its-about-time-i-tried-to-explain-what-progressive-enhancement-actually-is/\">progressive enhancement</a> as the bedrock of building truly solid experiences. I'll forever do that!</p>\n<p>The problem is that I consistently get questions that could be boiled down to:</p>\n<blockquote>\n<p>I get what you're saying, but I couldn't possibly do that in my job because I'm being asked to ship fast, by any means necessary</p>\n</blockquote>\n<p>I completely get that and I've been in that exact situation <em>numerous</em> times in my career. What I and the wider Piccalilli team <em>really</em> want to teach you, is how leaning into the browser and allowing it to do its job will <strong>speed you up, massively</strong>.</p>\n<p>By <a href=\"https://piccalil.li/complete-css/lessons/5\">moving slowly and methodically, you go faster</a> because <strong>slow is smooth</strong> and <strong>smooth is fast</strong>.</p>\n<p>I  deliberately link to <a href=\"https://piccalil.li/complete-css\">my course</a> here because in that specific lesson, I share a monumental failure in my career that would have been solved by taking a step back, thinking logically and planning. Thinking logically and planning truly <em>is at</em>  <strong>the core of great work</strong>, along with communication skills.</p>\n<p></p><p>Watch the <a href=\"https://www.youtube.com/embed/tHtFiciT2tQ?si=8lOLRqhy4_Zp2a4W\">video</a>.</p><p></p>\n<p>I know a lot of you don't have access to the course, so if <a href=\"https://youtu.be/tHtFiciT2tQ?si=R-rroKmSwfi6e1jp&amp;t=1569\">you skip to around 26:09</a> in the video above, you can see the part of the course within the talk material.</p>\n<p>As I see it, everyone should have <strong>free access to</strong> <strong>real world education</strong>. I <a href=\"https://bell.bz/im-getting-fed-up-of-making-the-rich-richer/\">talk about that in a recent article</a> that outlines the problem's we're trying to solve, but allow me to pick this part out:</p>\n<blockquote>\n<p>I want us to push further than that though and do full projects in the open, sharing as much as we possibly can during all parts of the process.</p>\n</blockquote>\n<p>Design studios and agencies — including ours — so often do everything <em>behind closed doors</em>. If we can fling open the doors to <strong>how a real design studio works</strong>, it gives people the ammunition to make real changes in their work because from learning from projects in the open, they can reference them as real success case studies to their decision makers, and make the case for better approaches. Not only that, but <strong>everyone</strong> can <em>learn</em> how to get away from the hype cycles in tech, and instead, build a truly rounded skillset that leverages web standards and empathetic practices.</p>\n<p>As I <a href=\"https://bell.bz/im-getting-fed-up-of-making-the-rich-richer/\">also mention in my article</a></p>\n<blockquote>\n<p>I always wanted the studio to do net good and give back as much — if not more — than it takes</p>\n</blockquote>\n<p>This overall plan does exactly that, as I see it. We also need this sort of content in the industry right now because I know I'm not alone in being dragged down by the <em>constant</em> discourse on AI slop and taking shortcuts. Content that is centered on <em>the craft</em> and focusing on <strong>doing right for users,</strong> needs more representation to counter all of that.</p>\n<p>There's a very loud part of the industry that is trying to race to a finish line that isn't even defined, aside from \"we must hit KPIs\" and \"we must bring value to the shareholders\". By utilising AI, vapourware frameworks and hype cycles, we — developers, designers and practitioners — are being forced to take those shortcuts to \"make the line go up\".</p>\n<p>It's not sustainable and there is an inevitability that the AI bubble is going to continue dominating the industry for a long time, but it <em>will,</em>  eventually burst. I'm not saying AI is not a going to be a permanent fixture in our lives — we've already lost that battle, and I imagine there <em>are</em> good uses in science, for example — but the tech industry hype bubble around generative AI <em>will</em>  eventually burst.</p>\n<p>It makes sense that when it does, we as an industry and community have done everything we can to be in a position to deliver extremely high quality work, to counter the <em>extensive</em> damage that is currently being done.</p>\n<p>The damage done is escalating an an alarming pace already — <a href=\"https://bsky.app/profile/bell.bz/post/3loj2o2zra22r\">just check out this thread of when I was collecting the horrors for only 24 hours</a>. There's going to be lots of <em>good</em> work that needs doing. Being a highly skilled practitioner will be very helpful, so we'd love to contribute to helping get as many people as possible in a position to be able to do that.</p>\n\n<p>We as a community need to do everything we can to counter the extensive damage that is being done.</p>\n\n<p>I've also been trying to settle on a writing focus after completing such a massive writing project in <a href=\"https://complete-css.com/\">Complete CSS</a>. I think all of this is exactly what I and the team need to be doing in order to  contribute  to <em>bettering</em> this industry of ours. It's the most excited I've been about <em>anything</em> work related for <em>years</em>.</p>\n<h2>What your financial support will unlock</h2>\n<ol>\n<li>Real world projects — for both our industry and for progressive movements — that are completed in the open, with each part of the process covered in a combination of articles, videos and live streams</li>\n<li>Further investment in the content you all know and love from Piccalilli. This means more industry expert guest authors, more deep dives and more day-to-day advice that will make you a <em>better</em> designer and developer</li>\n<li>The <a href=\"https://set.studio/\">Set Studio</a> team working near <strong>full time</strong> on Piccalilli</li>\n</ol>\n<p>That's the first stretch goal. We want to push that even further though. Beyond our initial milestone, we want to unlock the following:</p>\n<ol>\n<li>Bring in our network of extremely talented and independent experts who specialise in content design, accessibility, design and development to work on these projects</li>\n<li>Get these individuals <em>paid.</em> This  is so needed in a continuously <em>dry</em> industry of  experts not wanting to work on AI <em>slop</em></li>\n<li>Provide even deeper education with these experts</li>\n</ol>\n<h2>Wrapping up</h2>\n<p>It makes me <em>very</em> uncomfortable to ask for money, however  we're in a pretty <em>perfect</em> position to at least try this. I can't stress enough how much we need your support to do it though.</p>\n<p>If you work in a company that funds open source, maybe talk to your boss about funding this plan too? It makes your company look great and it keeps us on the mission.</p>\n<p>I'd love to look back in 12 months time and think \"thank god we did this\". I'd also love to look back in 12 months and appreciate the progressive movements that we have helped change, along with the <em>thousands</em> of developers that have received high quality education <strong>for free</strong>.</p>\n<p>This isn't the internet we currently want, and it's certainly not the internet that <em>we, as a global community,</em> built in the first place. I know you're also <em>fed up</em> with it being <em>carved up</em> in front of you. We want to use our platform to try and contribute to changing that, or at least maintain corners of the internet that genuinely help people.</p>\n<p>I really believe this is a truly unique offering and if it works, should bring nothing but good. It's certainly worth a try, right?</p>\n<p>Support Piccalilli on Open Collective</p>\n        ",
      "categories": []
    },
    {
      "title": "How To Optimize Document Request Latency",
      "url": "https://www.debugbear.com/blog/document-request-latency",
      "author": "DebugBear",
      "pubDate": "2025-05-12T00:00:00.000Z",
      "description": "Learn why the HTML document request is crucial for page speed and what you can do to optimize it.",
      "categories": []
    },
    {
      "title": "The Height Enigma",
      "url": "https://www.joshwcomeau.com/css/height-enigma/",
      "author": "Josh W. Comeau",
      "pubDate": "2025-05-12T11:30:00.000Z",
      "description": "One of the most perplexing and befuddling things in CSS for me, for many years, was the behaviour of percentage-based heights. Sometimes, seemingly at random, setting “height: 100%” would have no effect at all. When I finally figured out what was going on, it was like a puzzle piece snapping into place; everything made so much more sense! In this post, I’ll share the epiphany I had, and we’ll explore some solutions.",
      "categories": []
    }
  ]
}